/**
 * このファイルはデータベース関連の型を定義しています。
 */

/*================================================================================
 COMMON
=============================================================================== */

export type TableType = "users" | "templates" | "blogs";

/*================================================================================
 GET
=============================================================================== */

// テーブル設定用型(カラム指定、昇順、降順)
export type TableOrderByType = { column: string; direction: "asc" | "desc" };

// テーブルの条件設定
export type WhereOptions = {
  // 等価比較(複数も可)
  equal?: { [key: string]: number | string };
  // 非等価比較(複数も可)
  notEqual?: { [key: string]: number | string };
  // 部分文字列(複数も可)
  contains?: { [key: string]: string };
  // nullでないか
  notNull?: string[];
};

// テーブルのリレーション設定
export type IncludeType = {};
/*================================================================================
 POST
=============================================================================== */
